1. 명령모드
1.1 커서 이동
    한칸 좌우상하 이동    : h,l, i, j
    단어 이동           : w(다음), b(이전)
    페이지 이동         : Ctrl+f, Ctrl+b
    처음, 끝 이동       : 0(처음), $(끝), ^(처음단어)

1.2 반복/취소
    . : 편집한 것을 반복
    u : 편집한 것을 되돌림 (undo)

1.3 복사/삭제/붙여넣기
    x  : 한 글자 삭제
        3x : 3글자 삭제
    dw : 한 단어 삭제
        3dw : 3단어 삭제
    yy : 한줄 복사
        3yy : 3줄 복사
    dd : 한줄 삭제 (삭제 한 것도 자동으로 복사됨)
        3dd : 3줄 삭제
    p : 아래 줄에 붙여넣기
    P : 윗 줄에 붙여넣기

1.4 마크, 이동, 범위 복사,삭제
    ma : 커서 위치를 a 로 마크함 (a 외에 b,c,d,e,... 다 가능함)
    'a : a 위치로 이동

    응용 1) 범위 복사 (숫자세지말고)
        범위의 시작 부분에서 가서 => ma (a 에 마크하고)
        범위의 끝 부분에서 가서 => y'a (끝 위치에서 a 까지 복사)
        다른 곳에 가서 => p (붙여넣기)
    응용 2) 범위 삭제
        범위의 시작 부분에서 가서 => ma (a 에 마크하고)
        범위의 끝 부분에서 가서 => d'a (끝 위치에서 a 까지 삭제)
        다른 곳에 가서 => p (붙여넣기, 삭제한 것도 자동으로 복사됨으로 붙여넣게 할 수 있음)

1.5 버퍼링 - 여러 개를 복사/붙여넣기
    "ayy    : 1줄 복사해서 a 에 저장
    "b3yy   : 3줄 복사해서 b 에 저장
    다른 곳에 가서
    "ap     : a 에 저장된 것을 붙여넣기
    "bp     : b 에 저장된 것을 붙여넣기

    응용) 범위 복사해서 붙여넣기
        범위의 시작 부분에서 가서 => ma (a 에 마크하고)
        범위의 끝 부분에서 가서 => "ay'a (끝 위치에서 a 까지 복사해서 a에 저장)
        범위의 시작 부분에서 가서 => ma (a 에 마크하고)
        범위의 끝 부분에서 가서 => "by'a (끝 위치에서 a 까지 복사해서 b에 저장)
        다른 곳에 가서
        "ap     : a 에 저장된 것을 붙여넣기
        "bp     : b 에 저장된 것을 붙여넣기

1.6 tab 추가
    >> : 현재 줄을 우측으로 탭 추가
    << : 현재 줄을 좌측으로 탭 추가
    3>> : 3 줄을 우측으로 탭 추가
    3<< : 3 줄을 좌측으로 탭 추가

    응용) 범위를 정해서 탭 추가
        범위의 시작 부분에서 가서 => ma (a 에 마크하고)
        범위의 끝 부분에서 가서 => >'a (끝 위치에서 a 까지 탭 추가)

1.7 찾기, 다음 찾기
    /문자열 : / 치면 아래에 표시됨, 문자열 입력하고 엔터
    n : 다음 찾기
    N : 이전 찾기

2. 명령모드 -> 편집모드
    a : 현재 커서 다음 칸부터 입력
    A : 현재 커서의 줄 맨 마지막 부터 입력
    i : 현재 커서 위치부터 입력
    I : 현재 커서줄의 맨 앞부터 입력
    o : 현재 커서의 다음 줄에 입력
    O : 현재 커서의 이전 줄에 입력
    s : 현재 커서 위치의 한 글자를 지우고 입력
        3s : 3글자 지우고 입력
    cw : 한 단어을 지우고 입력
        3cw : 3단어를 지우고 입력
    C : 현재 커서에서 끝까지 지우고 입력

3. 명령모드 -> 명령 줄 모드
    ":" => : 치면 명령 줄 모드로 전환
    :w  : 저장
    :q  : 파일 닫기
    :wq : 저장하고 파일 닫기
    :q! : 저장하지 않고 닫기

    :3  : 3번째 줄로 이동

    :%s/찾을단어/바꿀단어       : 한 줄의 첫번째 단어만 바꿈
    :%s/찾을단어/바꿀단어/g     : 한 줄의 전체 단어를 바꿈
